<! 
 Copyright 2000, 2001, 2002, 2003, 2004, 2005 Dataprev - Empresa de Tecnologia e Informações da Previdência Social, Brasil

 Este arquivo é parte do programa CACIC - Configurador Automático e Coletor de Informações Computacionais

 O CACIC é um software livre; você pode redistribui-lo e/ou modifica-lo dentro dos termos da Licença Pública Geral GNU como 
 publicada pela Fundação do Software Livre (FSF); na versão 2 da Licença, ou (na sua opnião) qualquer versão.

 Este programa é distribuido na esperança que possa ser  util, mas SEM NENHUMA GARANTIA; sem uma garantia implicita de ADEQUAÇÂO a qualquer
 MERCADO ou APLICAÇÃO EM PARTICULAR. Veja a Licença Pública Geral GNU para maiores detalhes.

 Você deve ter recebido uma cópia da Licença Pública Geral GNU, sob o título "LICENCA.txt", junto com este programa, se não, escreva para a Fundação do Software
 Livre(FSF) Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA
>

<html>
<head>
<title>Ararib&oacute;ia</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body>
<p>&nbsp;</p>
<table width="85%" border="0" align="center">
  <tr> 
    <td><p><strong><font color="#333333" size="2" face="Verdana, Arial, Helvetica, sans-serif">Como 
        o CACIC funciona</font></strong></p>
      <p><font size="2" face="Verdana, Arial, Helvetica, sans-serif">Para que 
        possamos compreender melhor como o sistema funciona, podemos imagin&aacute;-lo, 
        metaforicamente, como uma grande empresa de presta&ccedil;&atilde;o de 
        servi&ccedil;os. Essa empresa tem um escrit&oacute;rio central que &eacute; 
        chefiado por um gerente geral que decide quais ser&atilde;o as atividades 
        realizadas por cada um dos oper&aacute;rios contratados pela empresa. 
        Dessa forma, o gerente geral tem um efetivo controle sobre quais atividades 
        foram realizadas e tamb&eacute;m quando, onde e por quais oper&aacute;rios 
        foram realizadas. </font></p>
      <p><font size="2" face="Verdana, Arial, Helvetica, sans-serif">A empresa 
        presta servi&ccedil;os a v&aacute;rios clientes em diversos munic&iacute;pios 
        e aloca apenas um &uacute;nico oper&aacute;rio para atender a um determinado 
        cliente. Este oper&aacute;rio fica lotado permanentemente nas depend&ecirc;ncias 
        f&iacute;sicas do cliente para o qual presta servi&ccedil;os e em intervalos 
        peri&oacute;dicos entra em contato com o gerente geral, questionando-lhe 
        quais atividades dever&atilde;o ser realizadas no cliente. Muitas vezes, 
        o gerente geral delega ao oper&aacute;rio atividades que requerem a utiliza&ccedil;&atilde;o 
        de algumas ferramentas especiais. Caso o oper&aacute;rio n&atilde;o disponha 
        dessas ferramentas ele ter&aacute; de deslocar-se ao escrit&oacute;rio 
        central para busc&aacute;-las. Por&eacute;m, caso ele esteja localizado 
        em um munic&iacute;pio muito distante do escrit&oacute;rio central, esse 
        deslocamento ocasionar&aacute; custos adicionais, al&eacute;m de aumentar 
        o tempo necess&aacute;rio para a conclus&atilde;o do servi&ccedil;o. Na 
        tentativa de evitar esses inconvenientes, o oper&aacute;rio, de forma 
        pr&oacute;-ativa, entrar&aacute; em contato com todos os outros oper&aacute;rios 
        da empresa que est&atilde;o prestando servi&ccedil;os no mesmo munic&iacute;pio 
        onde ele se encontra, questionando-os se eles disp&otilde;em das ferramentas 
        de que ele necessita. Cada oper&aacute;rio &quot;colega&quot; contatado 
        informar&aacute; se possui as ferramentas que foram solicitadas e, al&eacute;m 
        disso, a qual dist&acirc;ncia ele se situa do oper&aacute;rio que solicitou 
        as ferramentas. Dessa forma, o oper&aacute;rio requisitante poder&aacute; 
        obter as ferramentas necess&aacute;rias a partir do colega que est&aacute; 
        mais pr&oacute;ximo, minimizando custos e tempo de execu&ccedil;&atilde;o 
        do servi&ccedil;o.</font></p>
      <p><font size="2" face="Verdana, Arial, Helvetica, sans-serif">Caso nenhum 
        dos oper&aacute;rios contatados possua as ferramentas, o oper&aacute;rio 
        dever&aacute; ent&atilde;o deslocar-se ao escrit&oacute;rio central para 
        busc&aacute;-las. Se, em um segundo momento, um outro oper&aacute;rio, 
        que est&aacute; no mesmo munic&iacute;pio, necessitar de alguma dessas 
        ferramentas, ele poder&aacute; obt&ecirc;-las solicitando-as ao oper&aacute;rio 
        que, anteriormente, foi busc&aacute;-las no escrit&oacute;rio central. 
        Pode-se perceber que os oper&aacute;rios localizados em um mesmo munic&iacute;pio 
        colaboram entre si, ajudando seus colegas a realizarem suas atividades.<br>
        </font></p>
      <p><font size="2" face="Verdana, Arial, Helvetica, sans-serif"> </font></p>
      <table border="0" align="center" cellpadding="0">
        <tr> 
          <td><font size="2" face="Verdana, Arial, Helvetica, sans-serif"><img src="imgs/arquitetura.jpg"></font></td>
        </tr>
        <tr> 
          <td><div align="center"><font size="1" face="Verdana, Arial, Helvetica, sans-serif">Nova 
              arquitetura do CACIC</font></div></td>
        </tr>
      </table>
      <p align="center"><font color="#FFCC99" size="2" face="Verdana, Arial, Helvetica, sans-serif"><strong></strong></font></p>
      <p><font size="2" face="Verdana, Arial, Helvetica, sans-serif">&nbsp;<br>
        </font> </p></td>
  </tr>
</table>
<p><br>
</p>
</body>
</html>
