<html>
<head>
<title>Ararib&oacute;ia</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body>
<p>&nbsp;</p>
<table width="90%" border="0" align="center">
  <tr> 
    <td bgcolor="#CCCCCC"><div align="center"><strong><font color="#333333" size="3" face="Verdana, Arial, Helvetica, sans-serif">FAQ 
        - Frequent Asked Questions </font></strong></div></td>
  </tr>
  <tr> 
    <td><p><font size="2" face="Verdana, Arial, Helvetica, sans-serif"> <strong>1 
        - O que &eacute; o CACIC?<br>
        </strong></font><font size="2" face="Verdana, Arial, Helvetica, sans-serif">Trata-se 
        de um sistema de monitora&ccedil;&atilde;o de recursos de hardware e software, 
        configura&ccedil;&atilde;o remota e invent&aacute;rio, desenvolvido a 
        partir de 2000, pela equipe t&eacute;cnica da URES.</font></p>
      <p><font size="2" face="Verdana, Arial, Helvetica, sans-serif"> <strong>2 
        - Como funciona?</strong><br>
        Um conjunto de m&oacute;dulos agentes (cliente) s&atilde;o instalados 
        em cada esta&ccedil;&atilde;o de trabalho da rede. Um desses agentes, 
        em cada esta&ccedil;&atilde;o, interage com o m&oacute;dulo gerente (servidor).<br>
        <br>
        As informa&ccedil;&otilde;es coletadas e relat&oacute;rios s&atilde;o 
        disponibilizados via intranet.</font></p>
      <p><font size="2" face="Verdana, Arial, Helvetica, sans-serif"><strong>3 
        - Quem pode ter acesso a estas informa&ccedil;&otilde;es?<br>
        </strong>No CACIC os acessos dos usu&aacute;rios obedecem a perfis pr&eacute;-definidos, 
        de modo a preservar informa&ccedil;&otilde;es de circula&ccedil;&atilde;o 
        restrita.<br>
        <br>
        Para acesso aos m&oacute;dulos de consulta localizados no endere&ccedil;o 
        www-cacic, o usu&aacute;rio deve ser previamente cadastrado para que seja 
        efetuada a autentica&ccedil;&atilde;o pelo sistema.</font></p>
      <p><font size="2" face="Verdana, Arial, Helvetica, sans-serif"><strong>4 
        - Que tipo de benef&iacute;cios poderemos ter com sua utiliza&ccedil;&atilde;o?<br>
        </strong></font><font size="2" face="Verdana, Arial, Helvetica, sans-serif">- 
        Diagnosticar problemas de hardware, software e rede;<br>
        - Verificar se os sistemas fundamentais est&atilde;o instalados e atualizados;<br>
        - Detectar poss&iacute;veis vulnerabilidades a ataques e situa&ccedil;&otilde;es 
        de risco;<br>
        - Detectar altera&ccedil;&otilde;es de hardware e configurar aviso por 
        e-mail;<br>
        - Controlar a localiza&ccedil;&atilde;o dos computadores;<br>
        - Detectar mudan&ccedil;as na localiza&ccedil;&atilde;o dos micros, configurando 
        alerta por email;<br>
        - Registro em log de altera&ccedil;&otilde;es de hardware e configura&ccedil;&otilde;es 
        de rede;<br>
        - Verificar se atualiza&ccedil;&otilde;es de seguran&ccedil;a foram aplicadas;<br>
        - Checar situa&ccedil;&atilde;o do antiv&iacute;rus;<br>
        - Verificar licen&ccedil;as de uso e atualiza&ccedil;&otilde;es;<br>
        - Checar vari&aacute;veis de ambiente e configura&ccedil;&otilde;es em 
        uso;<br>
        - Executar automaticamente, alguns tipos de configura&ccedil;&atilde;o 
        de software;</font></p>
      <p><strong><font size="2" face="Verdana, Arial, Helvetica, sans-serif"> 
        5 - Quais usu&aacute;rios e setores na Dataprev devem utiliz&aacute;-lo?<br>
        </font></strong><font size="2" face="Verdana, Arial, Helvetica, sans-serif">- 
        Administradores de rede;<br>
        - Administradores de recursos t&eacute;cnicos;<br>
        - Gestores de patrim&ocirc;nio;<br>
        - Equipes de atendimento e opera&ccedil;&otilde;es das URXX&acute;s, UAXX&acute;s 
        e CT&acute;s;<br>
        - Gestores de contratos;<br>
        - Auditores.<br>
        <strong><br>
        </strong> </font><font size="2" face="Verdana, Arial, Helvetica, sans-serif"><strong>6 
        - Existem no mercado sistemas com a mesmas fun&ccedil;&otilde;es do CACIC?<br>
        </strong></font><font size="2" face="Verdana, Arial, Helvetica, sans-serif">Sim. 
        Existem produtos t&atilde;o bons e melhores, desenvolvidos por grandes 
        empresas e que agregam outras fun&ccedil;&otilde;es, tais como controle 
        de produtividade, bloqueios de aplica&ccedil;&otilde;es e URLs, controle 
        de conte&uacute;do de e-mail, rastreamento de dados, controle de distribui&ccedil;&atilde;o 
        de software, e acesso remoto.<br>
        Entretanto, tais produtos s&atilde;o pacotes fechados, com caracter&iacute;sticas 
        extremamente invasivas e que apresentam um custo elevad&iacute;ssimo de 
        instala&ccedil;&atilde;o, manuten&ccedil;&atilde;o e suporte(da ordem 
        de milh&otilde;es de reais, considerando o porte da rede da Previd&ecirc;ncia)<br>
        <br>
        </font><font size="2" face="Verdana, Arial, Helvetica, sans-serif"><strong>7 
        - O CACIC &eacute; um SPYWARE?<br>
        </strong></font><font size="2" face="Verdana, Arial, Helvetica, sans-serif">Spyware 
        &eacute; um tipo de software que, de forma dissimulada e n&atilde;o autorizada, 
        monitora atividades de um sistema ou usu&aacute;rio e envia as informa&ccedil;&otilde;es 
        coletadas para terceiros, configurando uma a&ccedil;&atilde;o maliciosa 
        e ilegal.<br>
        Por sua vez o CACIC &eacute; uma ferramenta de gest&atilde;o que, embora 
        execute coleta de informa&ccedil;&otilde;es, atua em conson&acirc;ncia 
        com as diretrizes, normas e procedimentos da Empresa. </font> </p>
      <font size="2" face="Verdana, Arial, Helvetica, sans-serif"> <strong>8 - 
      Outros &oacute;rg&atilde;os tamb&eacute;m utilizam o CACIC?<br>
      </strong></font><font size="2" face="Verdana, Arial, Helvetica, sans-serif">Sim. 
      Al&eacute;m da rede da Previd&ecirc;ncia, o CACIC encontra-se instalado 
      em mais de 50 &Oacute;rg&atilde;os P&uacute;blicos Federais, Estaduais e 
      Municipais, face a celebra&ccedil;&atilde;o do Termo de Cess&atilde;o de 
      Licen&ccedil;a de Sistema realizado entre DATAPREV e a SLTI(Minist&eacute;rio 
      do Planejamento), que tornou o CACIC um produto de uso p&uacute;blico.<br>
      Este sucesso, projeta favoravelmente na m&iacute;dia o nome da Dataprev, 
      sempre citada como desenvolvedora da solu&ccedil;&atilde;o.</font> <br> 
      <font size="2" face="Verdana, Arial, Helvetica, sans-serif"><br>
      <strong>9 - &#8220;Ouvi dizer&#8221; que o CACIC tem bug, &eacute; &#8221;pesado&#8221; 
      demais...<br>
      </strong></font><font size="2" face="Verdana, Arial, Helvetica, sans-serif">No 
      in&iacute;cio foram observados alguns problemas, principalmente em micros 
      mais lentos, superados completamente com a implementa&ccedil;&atilde;o de 
      melhorias no agente como forma e intervalo de coletas.</font> <p><font size="2" face="Verdana, Arial, Helvetica, sans-serif"><strong>10 
        - O CACIC foi avaliado pela DOP?</strong><br>
        A partir de uma avalia&ccedil;&atilde;o, realizada por equipe selecionada, 
        foi gerada uma nota t&eacute;cnica(NT CACIC), com diversas recomenda&ccedil;&otilde;es 
        sobre altera&ccedil;&atilde;o de linguagem, SGBD, arquitetura (recomenda 
        centraliza&ccedil;&atilde;o com investimento), documenta&ccedil;&atilde;o, 
        etc, visando a evolu&ccedil;&atilde;o do produto sob a &oacute;tica corporativa. 
        <br>
        Foi realizado um trabalho de desenvolvimento para adapta&ccedil;&atilde;o 
        &agrave;s recomenda&ccedil;&otilde;es e o foco principal foi a seguran&ccedil;a, 
        quando a aplica&ccedil;&atilde;o foi dotada de &quot;<em>criptografia</em> 
        <em>forte</em>&quot; dos dados trafegados, bem como cria&ccedil;&atilde;o 
        de usu&aacute;rios distintos para acessos pelas camadas &quot;<em>cliente</em>&quot; 
        e &quot;<em>servidor</em>&quot;.<br>
        <br>
        <strong> </strong> <strong>11 - O que fazer quando o anti-v&iacute;rus 
        reconhece o agente CACIC como v&iacute;rus?<br>
        </strong>Caso a esta&ccedil;&atilde;o utilize o anti-v&iacute;rus Avast, 
        este pode apresentar o chamado &quot;falso positivo&quot;, gerado por 
        um procedimento err&ocirc;neo de detec&ccedil;&atilde;o, por se tratar 
        de um programa que manda e envia informa&ccedil;&otilde;es do computador 
        ele reconhece como v&iacute;rus. Em outros anti-v&iacute;rus n&atilde;o 
        foi achada essa falha.</font></p>
      <p><font size="2" face="Verdana, Arial, Helvetica, sans-serif"><strong>12 
        - O meu Windows XP n&atilde;o executa e nem atualiza o agente do CACIC. 
        Como um usu&aacute;rio normal ele sempre d&aacute; erro, mas quando estou 
        logado como Administrador do Sistema ele executa normalmente. O que posso 
        fazer para resolver este problema?<br>
        </strong>Esse problema foi solucionado a partir de nova vers&atilde;o 
        do Atualizador/Instalador dos agentes, o ChkCacic, quando teve seu c&oacute;digo 
        implementado de tratamento de permiss&otilde;es de acesso &agrave; pasta 
        de instala&ccedil;&atilde;o.</font></p>
      <p><strong><font size="2" face="Verdana, Arial, Helvetica, sans-serif"> 
        </font></strong><font size="2" face="Verdana, Arial, Helvetica, sans-serif"><strong>13 
        - Quais s&atilde;o os requisitos m&iacute;nimos para instala&ccedil;&atilde;o 
        do agente no Windows?<br>
        </strong></font><font size="2" face="Verdana, Arial, Helvetica, sans-serif">Os 
        requisitos m&iacute;nimos para o Windows s&atilde;o: </font><font size="2" face="Verdana, Arial, Helvetica, sans-serif">Computador 
        Pentium 133MHz; 64MB de mem&oacute;ria RAM; 3MB dispon&iacute;vel em disco 
        r&iacute;gido.</font></p>
      <p><font size="2" face="Verdana, Arial, Helvetica, sans-serif"><strong> 
        14 - Meu cliente n&atilde;o esta conseguindo baixar todos os arquivos 
        do agente pelo FTP. O que fa&ccedil;o?<br>
        </strong></font><font size="2" face="Verdana, Arial, Helvetica, sans-serif">Esse 
        comportamento &eacute; comum nas vers&otilde;es em desenvolvimento do 
        CACIC. Para resolver essa quest&atilde;o, crie uma pasta &quot;modulos&quot; 
        no mesmo n&iacute;vel do chkcacic.exe, onde dever&atilde;o ser colocados 
        todos os arquivos execut&aacute;veis para uso do CACIC, pois, quando da 
        necessidade de download de m&oacute;dulo, o arquivo ser&aacute; apenas 
        copiado e n&atilde;o ser&aacute; necess&aacute;rio o FTP.</font></p>
      <p><font size="2" face="Verdana, Arial, Helvetica, sans-serif"><strong>15 
        - Onde no gerente fica a senha de configura&ccedil;&atilde;o do agente? 
        J&aacute; tentei todas as senhas que coloquei no gerente e nenhuma me 
        permite configurar o agente.<br>
        </strong></font><font size="2" face="Verdana, Arial, Helvetica, sans-serif">A 
        senha &eacute; definida no gerente atrav&eacute;s da op&ccedil;&atilde;o 
        Administra&ccedil;&atilde;o / Configurar Agentes. Deve-se observar que 
        a nova senha s&oacute; ser&aacute; &quot;conhecida&quot; pelo agente em 
        sua pr&oacute;xima execu&ccedil;&atilde;o de coletas. </font></p>
      <p><font size="2" face="Verdana, Arial, Helvetica, sans-serif"><strong> 
        16 - Como eu posso ver a comunica&ccedil;&atilde;o entre o agente e o 
        gerente? Eu posso ver o agente executando passo-a-passo durante a comunica&ccedil;&atilde;o 
        com o gerente?<br>
        </strong> A comunica&ccedil;&atilde;o entre eles foi documentada em: http://www.cetico.org/cacic/comunicacao_agente-gerente. 
        Essa comunica&ccedil;&atilde;o pode ser visualizada utilizando-se um aplicativo 
        como o Ethereal.</font></p>
      <p><font size="2" face="Verdana, Arial, Helvetica, sans-serif"><strong><font color="#333333">17 
        - A instala&ccedil;&atilde;o dos agentes do CACIC</font> requer a interven&ccedil;&atilde;o 
        ativa de algum t&eacute;cnico?</strong> <br>
        Os agentes do CACIC podem ser instalados passando-se as informa&ccedil;&otilde;es 
        necess&aacute;rias atrav&eacute;s da linha de comando. Dessa forma, o 
        procedimento de instala&ccedil;&atilde;o pode ser automatizado atrav&eacute;s 
        do uso de &quot;login scripts&quot;. </font></p>
      <p><font size="2" face="Verdana, Arial, Helvetica, sans-serif"><strong>18 
        - Quais s&atilde;o as informa&ccedil;&otilde;es usadas para identificar 
        unicamente um computador?</strong> <br>
        A informa&ccedil;&atilde;o usada para identificar unicamente um computador 
        &eacute; o endere&ccedil;o MAC da placa de rede. Sabemos que existe a 
        possibilidade de haver computadores com placas de rede com o mesmo endere&ccedil;o 
        MAC. Por&eacute;m estamos assumindo que essa &eacute; uma anomalia que 
        n&atilde;o ser&aacute; admitida pelo administrador da rede, visto que 
        poder&aacute; causar s&eacute;rios inconvenientes ao funcionamento de 
        toda a rede. </font></p>
      <p><font size="2" face="Verdana, Arial, Helvetica, sans-serif"><strong>19 
        - Por que algumas esta&ccedil;&otilde;es 95/98 n&atilde;o conseguem se 
        comunicar com o m&oacute;dulo gerente WEB?</strong> <br>
        Normalmente nessas vers&otilde;es do sistema operacional MS-Windows esse 
        problema &eacute; resolvido ap&oacute;s a atualiza&ccedil;&atilde;o do 
        &quot;Winsock2&quot;, que pode ser baixado gratuitamente do site da <a href="http://www.microsoft.com/windows95/downloads/contents/wuadmintools/s_wunetworkingtools/w95sockets2/">Microsoft</a>.</font><font size="2" face="Verdana, Arial, Helvetica, sans-serif"> 
        </font></p>
      <p><font size="2" face="Verdana, Arial, Helvetica, sans-serif"><strong>20 
        - Por que o CACIC n&atilde;o usa SOAP?</strong> <br>
        A tecnologia SOAP, a princ&iacute;pio, pareceu ser a ideal para a comunica&ccedil;&atilde;o 
        entre os computadores gerenciados e o servidor. Por&eacute;m, alguns motivos 
        nos levaram a reconsiderar a decis&atilde;o de utiliz&aacute;-la no projeto. 
        Os principais s&atilde;o os seguintes: </font></p>
      <ul>
        <li><font size="2" face="Verdana, Arial, Helvetica, sans-serif">Necessidade 
          de um parser XML externo (msxml.dll) que nem sempre est&aacute; dispon&iacute;vel 
          nos computadores gerenciados, principalmente em computadores com vers&otilde;es 
          do IE anteriores &agrave; vers&atilde;o 5.0. Isso iria contra uma de 
          nossas principais premissas: a cria&ccedil;&atilde;o de agentes independentes 
          de qualquer programa externo;<br>
          </font></li>
        <li><font size="2" face="Verdana, Arial, Helvetica, sans-serif">Execu&ccedil;&atilde;o 
          lenta, principalmente durante a primeira chamada aos procedimentos disponibilizados 
          no servidor;<br>
          </font></li>
        <li><font size="2" face="Verdana, Arial, Helvetica, sans-serif">Aumento 
          consider&aacute;vel no tamanho do execut&aacute;vel gerado (al&eacute;m 
          da necessidade das dlls do parser XML, caso este n&atilde;o esteja dispon&iacute;vel);<br>
          </font></li>
        <li><font size="2" face="Verdana, Arial, Helvetica, sans-serif">Mensagens 
          XML contendo informa&ccedil;&otilde;es de cabe&ccedil;alho que s&atilde;o 
          desnecess&aacute;rias aos nosssos prop&oacute;sitos, o que causaria, 
          desnecessariamente, um tr&aacute;fego adicional de dados na rede;<br>
          </font></li>
        <li><font size="2" face="Verdana, Arial, Helvetica, sans-serif">Necessidade 
          do componente HTTPRIO, o qual n&atilde;o est&aacute; dispon&iacute;vel 
          no Kylix Open Edition. Dessa forma, poderemos usar apenas os componentes 
          de comunica&ccedil;&atilde;o <a href="http://www.indyproject.org/indy.html" target="_blank">Indy</a>, 
          o qual est&aacute; dispon&iacute;vel gratuitamente para Delphi e Kylix.<br>
          </font><font size="2" face="Verdana, Arial, Helvetica, sans-serif"> 
          </font> </li>
      </ul>
      <p><font size="2" face="Verdana, Arial, Helvetica, sans-serif"><strong>21 
        - Quem seriam os t&eacute;cnicos a quem se deve reportar bugs, qual o 
        esquema de suporte, qual o papel da DIAO/DEAPO neste processo, quais s&atilde;o 
        os outros setores envolvidos, quem s&atilde;o os contatos nesses setores, 
        tels., etc.?<br>
        </strong>No caso de manuten&ccedil;&atilde;o ou desenvolvimento de novas 
        rotinas deve ser acionada a DIAO, que far&aacute; uma an&aacute;lise junto 
        ao URES e as demais unidades usu&aacute;rias. Caso deva ser efetuada alguma 
        mudan&ccedil;a no sistema, ser&aacute; aberta uma demanda para o DERC, 
        departamento respons&aacute;vel pela sustenta&ccedil;&atilde;o do <br>
        produto CACIC.</font></p>
      <p><font size="2" face="Verdana, Arial, Helvetica, sans-serif">Por&eacute;m, 
        neste primeiro momento, de implanta&ccedil;&atilde;o nas unidades, est&atilde;o 
        sendo priorizadas apenas as manuten&ccedil;&otilde;es.</font></p>
      <p><font size="2" face="Verdana, Arial, Helvetica, sans-serif">Em caso de 
        suporte t&eacute;cnico, entrar em contato com a URES, onde est&aacute; 
        a cultura t&eacute;cnica sobre a ferramenta em quest&atilde;o e, tamb&eacute;m, 
        por eles serem os desenvolvedores, desde a primeira vers&atilde;o e tamb&eacute;m 
        atualmente, ap&oacute;s defini&ccedil;&atilde;o junto ao DERC.</font><br>
      </p>
      <p><font size="2" face="Verdana, Arial, Helvetica, sans-serif"><strong> 
        </strong> </font> </p>
      <font size="2" face="Verdana, Arial, Helvetica, sans-serif">: </font> 
      <ul>
        <ul>
        </ul>
      </ul></td>
  </tr>
</table>
<p><br>
</p>
</body>
</html>
